// 콘솔(console)창에
// 자신의 이름과 나이가 출력되도록
// C 프로그램을 작성

//  표준 입출력을 위한 <stdio.h> 헤더 파일을 포함
#include <stdio.h>

// 프로그램의 시작 함수인 main 함수 작성
int main()
{
	// 이름을 출력하기 위한 printf 함수
	printf("name : 박성준, age : 33세\n");

	// 프로그램 종료
	return 0;
}

// 코드 편집을 위한 단축기
// - ctrl + 좌, 우 : 커서를 단어 별로 이동
// - home          : 커서를 해당 라인 맨 앞으로 이동
// - end           : 커서를 해당 라인 맨 뒤로 이동

// - ctrl + d        : 지정된 코드를 아래 붙여넣기
// - ctrl + x        : 현재 라인 잘라내기(붙여넣기 가능)
// - alt + 상, 하  : 지정된 코드를 위 또는 아래로 이동
// - alt + shift + 상, 하 : 커서 복사(늘리기),(동시입력)
// - delete          : 커서를 기준으로 뒤의 문자 삭재
//-----------------------------------------------------------------
// - ctrl + shift + a : 새 항목 만들기
// - ctrl + F5        : 실행
