package package0904;

public class Example01 {
	public static void main(String[] args) {
		// 1. 1부터 20까지의 정수를 출력하는 반복문을 작성
		
		int num = 1;
		
		while (num < 21) {
			System.out.println(num);
			num++;
		}
		
		System.out.println("========================================");
		//---------------------------------------------------------------
		// 2. 1부터 20까지의 정수를 역순으로 출력하는 반복문을 작성
		
		int num2 = 20;
		while (num2 > 0) {
			System.out.println(num2);
			num2--;
		}
		
		System.out.println("========================================");
		//---------------------------------------------------------------
		// 3. 1부터 20까지의 정수를 역순으로 출력하는 반복문을 작성
		
		int num3 = 1;
		while (num3 < 21) {
			if (num3 % 2 == 0) System.out.println(num3);
			num3++;
		}
		
		System.out.println("========================================");
		//---------------------------------------------------------------
		// 4. 1부터 10까지의 정수의 합을 구하는 반복문을 작성
		
		int sum = 0;

		for (int i = 1; i < 11; i++) {
			sum += i;
		}
		System.out.println(sum);
		
		System.out.println("========================================");
		//---------------------------------------------------------------
	}
}
